In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:

covid_df = pd.read_csv("covid19_data.csv")
covid_df.head()

  country country_name  deaths  cases        lat       long
0      AF  Afghanistan      15    484  33.939110  67.709953
1      AL      Albania      22    409  41.153332  20.168331
2      DZ      Algeria     205   1572  28.033886   1.659626
3      AD      Andorra      24    566  42.546245   1.601554
4      AO       Angola       2     19 -11.202692  17.873887

In [12]:
rds_connection_string = "postgres:postgres@localhost:5432/covid19"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [13]:
engine.table_names()

['the_rona']

In [14]:
covid_df.to_sql(name='the_rona', con=engine, if_exists='append', index=False)

In [15]:
pd.read_sql_query('select * from the_rona', con=engine).head()

  country country_name  deaths  cases        lat       long
0      AF  Afghanistan      15    484  33.939110  67.709953
1      AL      Albania      22    409  41.153332  20.168331
2      DZ      Algeria     205   1572  28.033886   1.659626
3      AD      Andorra      24    566  42.546245   1.601554
4      AO       Angola       2     19 -11.202692  17.873887